notes/ruby.org
* Bootstrapping your ruby literacy
** Variables

   | Type     | Ruby Convention | Nonconventional             |
   |----------+-----------------+-----------------------------|
   | Local    | ~first_name~    | ~firstName, +firstName~     |
   | Instance | ~@first_name~   | ~@FirstName, @firstname~    |
   | Class    | ~@@first_name~  | ~@@First_name, @@firstName~ |
   | Global   | ~$FIRST_NAME~   | ~$first_name, $firstName~   |

   instance variable are initialized to nil
   #+BEGIN_SRC ruby
     @var
   #+END_SRC

   #+RESULTS:
   : nil

   local variable are not initialized, not even to nil
   #+BEGIN_SRC ruby
     var
   #+END_SRC

   #+RESULTS:
   : undefined local variable or method `var' for main:Object (NameError)

** Installation directories

   ~$ irb -simple-prompt -rrbconfig~

   will launch irb and load rbconfig interface which contains a lot
   of compiled information about your ruby installation

   Then you can use ~RbConfig::CONFIG~ to get information about your
   ruby installation.

   Notable directories are

| Term        | Directory contents                                                      |
|-------------+-------------------------------------------------------------------------|
| rubylibdir  | Ruby Standard library                                                   |
| bindir      | Ruby command line tools                                                 |
| archdir     | Architecture-specific extensions and librairies (compiled binary files) |
| sitedir     | Your own or third party librairies (in Ruby)                            |
| vendordir   | Third-party extensions and librairies (in Ruby)                         |
| sitelibdir  | Your own Ruby language extensions  (in Ruby)                            |
| sitearchdir | Your own Ruby language extensions (in C)                                |

** Load and Require

~$:~ is the load path global variable. You can add directories to load
path. For example =~$: << '.'~=.
One major difference between /load/ and /require/ if called more
than once with the same arguments is that require doesn’t reload
files it’s already loaded.

* Objects, methods and local variables
  method definitions evaluates to the symbol ~:m~ representing the
  name of the method that’s just defined.

** ?

  Use question mark for method names that evaluate to ~true~ or ~false~.

** nil ~= false != true

   Everything in Ruby has a Boolean value.
   ~nil~ and ~false~ both have a Boolean value of /false/.
   Furthermore ~true~, ~nil~ and ~false~ are objects.
   Note that ~puts~ returns nil

** Object behavior

   3 very useful and common functions
   + ~object_id~
   + ~respond_to?~
   + ~send~ (you can use ~__send__~ if you want to
     make sure you use Ruby’s built in method send)

   #+BEGIN_SRC ruby
     if object.respond_to?(request)
       puts ticket.send(request)
     end
   #+END_SRC

