notes/ruby.html
<!DOCTYPE html>
<html>
<head>
<title>ruby</title>
<!-- 2014-11-10 Mon 17:41 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Aurélien Bottazini">
</head>
<body>
<div id="content">
<h1 class="title">ruby</h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Bootstrapping your ruby literacy</a>
<ul>
<li><a href="#sec-1-1">1.1. Variables</a></li>
<li><a href="#sec-1-2">1.2. Installation directories</a></li>
<li><a href="#sec-1-3">1.3. Load and Require</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Objects, methods and local variables</a>
<ul>
<li><a href="#sec-2-1">2.1. ?</a></li>
<li><a href="#sec-2-2">2.2. nil ~= false != true</a></li>
<li><a href="#sec-2-3">2.3. Object behavior</a></li>
<li><a href="#sec-2-4">2.4. Arguments</a></li>
<li><a href="#sec-2-5">2.5. Immediate values</a></li>
<li><a href="#sec-2-6">2.6. Freeze, Dup and Clone</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Organizing objects with classes</a>
<ul>
<li><a href="#sec-3-1">3.1. initialize</a></li>
<li><a href="#sec-3-2">3.2. % sign technique</a></li>
<li><a href="#sec-3-3">3.3. assignment-like methods</a></li>
<li><a href="#sec-3-4">3.4. setter methods</a></li>
<li><a href="#sec-3-5">3.5. attributes</a></li>
<li><a href="#sec-3-6">3.6. Subclass</a></li>
<li><a href="#sec-3-7">3.7. Superclass &amp; Modules</a></li>
<li><a href="#sec-3-8">3.8. <code>BasicObject</code>, <code>Object</code> &amp; <code>Kernel</code></a></li>
<li><a href="#sec-3-9">3.9. Methods &amp; Constant notation</a></li>
<li><a href="#sec-3-10">3.10. Constants</a></li>
<li><a href="#sec-3-11">3.11. <code>inspect</code></a></li>
</ul>
</li>
<li><a href="#sec-4">4. Modules and program organization</a>
<ul>
<li><a href="#sec-4-1">4.1. Class and Module naming</a></li>
<li><a href="#sec-4-2">4.2. <code>method_missing</code></a></li>
<li><a href="#sec-4-3">4.3. including a module several times</a></li>
<li><a href="#sec-4-4">4.4. <code>prepend</code></a></li>
<li><a href="#sec-4-5">4.5. method lookup summary</a></li>
<li><a href="#sec-4-6">4.6. <code>super</code></a></li>
<li><a href="#sec-4-7">4.7. Nesting modules and classes</a></li>
</ul>
</li>
<li><a href="#sec-5">5. The default Object (self), scope &amp; visibility</a>
<ul>
<li><a href="#sec-5-1">5.1. Don't hard code class names.</a></li>
<li><a href="#sec-5-2">5.2. instance variables</a></li>
<li><a href="#sec-5-3">5.3. built-in classes</a></li>
<li><a href="#sec-5-4">5.4. class variables (@@)</a></li>
<li><a href="#sec-5-5">5.5. public, private, protected</a>
<ul>
<li><a href="#sec-5-5-1">5.5.1. private setter methods</a></li>
</ul>
</li>
<li><a href="#sec-5-6">5.6. top level method</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Control-flow techniques</a>
<ul>
<li><a href="#sec-6-1">6.1. if</a></li>
<li><a href="#sec-6-2">6.2. unless</a></li>
<li><a href="#sec-6-3">6.3. case</a></li>
<li><a href="#sec-6-4">6.4. <i><code>=</code></i></a></li>
<li><a href="#sec-6-5">6.5. loop</a></li>
<li><a href="#sec-6-6">6.6. while and until modifiers</a></li>
<li><a href="#sec-6-7">6.7. for</a></li>
<li><a href="#sec-6-8">6.8. curly braces vs do/end code block</a></li>
<li><a href="#sec-6-9">6.9. each and map</a></li>
<li><a href="#sec-6-10">6.10. Block parameters and scope</a></li>
<li><a href="#sec-6-11">6.11. rescue</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Built in essentials</a>
<ul>
<li><a href="#sec-7-1">7.1. Literal constructors</a></li>
<li><a href="#sec-7-2">7.2. Shortcut operators (syntactic sugar)</a></li>
<li><a href="#sec-7-3">7.3. Unary operators</a></li>
<li><a href="#sec-7-4">7.4. dangerous<sub>method</sub>!</a></li>
<li><a href="#sec-7-5">7.5. conversions</a></li>
<li><a href="#sec-7-6">7.6. Comparisons</a>
<ul>
<li><a href="#sec-7-6-1">7.6.1. Comparable module</a></li>
</ul>
</li>
<li><a href="#sec-7-7">7.7. Inspecting</a></li>
<li><a href="#sec-7-8">7.8. <code>try_convert</code></a></li>
</ul>
</li>
<li><a href="#sec-8">8. Strings, symbols and other scalar objects</a>
<ul>
<li><a href="#sec-8-1">8.1. String interpolation</a></li>
<li><a href="#sec-8-2">8.2. “Here” document or <i>here-doc</i></a></li>
<li><a href="#sec-8-3">8.3. Basic string manipulation</a>
<ul>
<li><a href="#sec-8-3-1">8.3.1. Selection</a></li>
<li><a href="#sec-8-3-2">8.3.2. changing strings</a></li>
</ul>
</li>
<li><a href="#sec-8-4">8.4. Querying strings</a></li>
<li><a href="#sec-8-5">8.5. String comparison</a></li>
<li><a href="#sec-8-6">8.6. transformations</a></li>
<li><a href="#sec-8-7">8.7. Conversions</a></li>
<li><a href="#sec-8-8">8.8. Encoding</a>
<ul>
<li><a href="#sec-8-8-1">8.8.1. Strings</a></li>
</ul>
</li>
<li><a href="#sec-8-9">8.9. Symbols</a></li>
<li><a href="#sec-8-10">8.10. Numerical object</a></li>
<li><a href="#sec-8-11">8.11. Times and dates</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Collection and container objects</a>
<ul>
<li><a href="#sec-9-1">9.1. Array</a>
<ul>
<li><a href="#sec-9-1-1">9.1.1. Inserting, retrieving and removing from an array</a></li>
<li><a href="#sec-9-1-2">9.1.2. Querying</a></li>
</ul>
</li>
<li><a href="#sec-9-2">9.2. Hashes</a>
<ul>
<li><a href="#sec-9-2-1">9.2.1. Hash methods</a></li>
<li><a href="#sec-9-2-2">9.2.2. Querying</a></li>
</ul>
</li>
<li><a href="#sec-9-3">9.3. Ranges</a></li>
<li><a href="#sec-9-4">9.4. Sets</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Collections Central: Enumerable and Enumerator</a>
<ul>
<li><a href="#sec-10-1">10.1. Queries:</a></li>
<li><a href="#sec-10-2">10.2. Search and Select</a></li>
<li><a href="#sec-10-3">10.3. Element operations:</a></li>
<li><a href="#sec-10-4">10.4. Each relatives</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Bootstrapping your ruby literacy</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Variables</h3>
<div class="outline-text-3" id="text-1-1">
<table>


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Ruby Convention</th>
<th scope="col" class="left">Nonconventional</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Local</td>
<td class="left"><code>first_name</code></td>
<td class="left"><code>firstName, +firstName</code></td>
</tr>

<tr>
<td class="left">Instance</td>
<td class="left"><code>@first_name</code></td>
<td class="left"><code>@FirstName, @firstname</code></td>
</tr>

<tr>
<td class="left">Class</td>
<td class="left"><code>@@first_name</code></td>
<td class="left"><code>@@First_name, @@firstName</code></td>
</tr>

<tr>
<td class="left">Global</td>
<td class="left"><code>$FIRST_NAME</code></td>
<td class="left"><code>$first_name, $firstName</code></td>
</tr>
</tbody>
</table>

<p>
instance variable are initialized to nil
</p>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a0522d;">@var</span>
</pre>
</div>

<p>
local variable are not initialized, not even to nil
</p>
<div class="org-src-container">

<pre class="src src-ruby">var
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Installation directories</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<code>$ irb -simple-prompt -rrbconfig</code>
</p>

<p>
will launch irb and load rbconfig interface which contains a lot
of compiled information about your ruby installation
</p>

<p>
Then you can use <code>RbConfig::CONFIG</code> to get information about your
ruby installation.
</p>

<p>
Notable directories are
</p>

<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Term</th>
<th scope="col" class="left">Directory contents</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">rubylibdir</td>
<td class="left">Ruby Standard library</td>
</tr>

<tr>
<td class="left">bindir</td>
<td class="left">Ruby command line tools</td>
</tr>

<tr>
<td class="left">archdir</td>
<td class="left">Architecture-specific extensions and librairies (compiled binary files)</td>
</tr>

<tr>
<td class="left">sitedir</td>
<td class="left">Your own or third party librairies (in Ruby)</td>
</tr>

<tr>
<td class="left">vendordir</td>
<td class="left">Third-party extensions and librairies (in Ruby)</td>
</tr>

<tr>
<td class="left">sitelibdir</td>
<td class="left">Your own Ruby language extensions  (in Ruby)</td>
</tr>

<tr>
<td class="left">sitearchdir</td>
<td class="left">Your own Ruby language extensions (in C)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Load and Require</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>$:</code> is the load path global variable. You can add directories to load
path. For example <code>~$: &lt;&lt; '.'~</code>.
One major difference between <i>load</i> and <i>require</i> if called more
than once with the same arguments is that require doesn’t reload
files it’s already loaded.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Objects, methods and local variables</h2>
<div class="outline-text-2" id="text-2">
<p>
method definitions evaluates to the symbol <code>:m</code> representing the
name of the method that’s just defined.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> ?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Use question mark for method names that evaluate to <code>true</code> or <code>false</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> nil ~= false != true</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Everything in Ruby has a Boolean value.
<code>nil</code> and <code>false</code> both have a Boolean value of <i>false</i>.
Furthermore <code>true</code>, <code>nil</code> and <code>false</code> are objects.
Note that <code>puts</code> returns nil
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Object behavior</h3>
<div class="outline-text-3" id="text-2-3">
<p>
3 very useful and common functions
</p>
<ul class="org-ul">
<li><code>object_id</code>
</li>
<li><code>respond_to?</code>
</li>
<li><code>send</code> (you can use <code>__send__</code> if you want to
make sure you use Ruby’s built in method send)
</li>
</ul>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">if</span> object.respond_to?(request)
  <span style="color: #483d8b;">puts</span> ticket.send(request)
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>
