notes/ruby.html

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Arguments</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<code>*</code> allows any number of arguments and <i>sponges</i> arguments if
placed between other arguments.
Use <code>=</code> to supply a default value for arguments.
</p>

<table>


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="left">method signature</th>
<th scope="col" class="left">sample call(s)</th>
<th scope="col" class="left">variable assignements</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>def m(*a)</code></td>
<td class="left"><code>m(1,2,3)</code></td>
<td class="left"><code>a = [1,2,3]</code></td>
</tr>

<tr>
<td class="left"><code>def m(a, b=1)</code></td>
<td class="left"><code>m(2)</code></td>
<td class="left"><code>a = 2, b = 1</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>m(2,3)</code></td>
<td class="left"><code>a = 2, b = 3</code></td>
</tr>

<tr>
<td class="left"><code>def m(a, b = 2, *c, d)</code></td>
<td class="left"><code>m(1, 3)</code></td>
<td class="left"><code>a = 1, b = 2, c = [], d = 3</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>m(1, 3, 5, 7)</code></td>
<td class="left"><code>a = 1, b = 3, c = [5], d = 7</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>m(1, 3, 5, 7, 9)</code></td>
<td class="left"><code>a = 1, b = 3, c = [5, 7], d = 9</code></td>
</tr>

<tr>
<td class="left"><code>def m(a:, b:)</code></td>
<td class="left"><code>m(a:1, b:2)</code></td>
<td class="left"><code>a = 1, b = 2</code></td>
</tr>

<tr>
<td class="left"><code>def m(a: 1, b: 2)</code></td>
<td class="left"><code>m</code></td>
<td class="left"><code>a = 1, b = 2</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left"><code>m(3, 4)</code></td>
<td class="left"><code>a = 3, b = 4</code></td>
</tr>

<tr>
<td class="left"><code>def m(x, y, *z, a:1, b:, **c, &amp;block)</code></td>
<td class="left"><code>m(1,2,3,4,5,b:10,p:20,q:30)</code></td>
<td class="left"><code>x = 1, y= 2, z=[3,4,5], a = 1, b = 10, c = {:p =&gt; 20, :q =&gt; 30}</code></td>
</tr>

<tr>
<td class="left">c here absorbs unknown named arguments</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
When using <code>Hashes</code> as arguments. If it is the last argument you
can write it without curly braces
</p>

<div class="org-src-container">

<pre class="src src-ruby">add_to_database(<span style="color: #8b2252;">'Lille'</span>, <span style="color: #008b8b;">country</span>: <span style="color: #8b2252;">'France'</span>, <span style="color: #008b8b;">postal_code</span>: 62000)
</pre>
</div>

<p>
If it is the first argument you must use parentheses (or ruby
will think it is a block) and curly braces
</p>

<div class="org-src-container">

<pre class="src src-ruby">add_to_database({country =&gt; <span style="color: #8b2252;">'France'</span>, postal_code =&gt; 62000}, <span style="color: #8b2252;">'Lille'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Immediate values</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Some objects like <i>Integers</i>, <i>symbols</i> and <code>true</code>, <code>false</code>,
<code>nil</code> are stored in variables as immediate value. The variable
holds the value itself rather than a reference to it.
</p>

<p>
It follows that there is only one object <code>1</code>, only one <code>true</code>.
And that's why there is no <code>++</code> operator in ruby. Because <code>1++</code>
means you'd be changing the number 1 to 2 and that makes no
sense.
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Freeze, Dup and Clone</h3>
<div class="outline-text-3" id="text-2-6">
<p>
You can freeze an object ruby to prevent and object from
undergoing further changes.
</p>

<p>
<code>dup</code> duplicates an object. <code>clone</code> duplicate an object and if
the cloned object was frozen, the clone is also frozen.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Organizing objects with classes</h2>
<div class="outline-text-2" id="text-3">
<p>
Everything you handle in Ruby is either an object or a construct
that evaluates to an object.
Every object is an instance of some class.
</p>

<p>
Class definitions evaluates to the last expression contained
inside it, or <code>nil</code> if the block is empty.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> initialize</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Arguments used with <code>new</code> are automatically sent to <code>initialize</code>.
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> % sign technique</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Allows to use sprintf-like syntax. Run ri sprintf for full documentation.
</p>
<div class="org-src-container">

<pre class="src src-ruby">price = 2.84839849
<span style="color: #483d8b;">p</span> <span style="color: #8b2252;">"</span><span style="color: #a0522d;">#{"%.2f" % price}</span><span style="color: #8b2252;">"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> assignment-like methods</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-ruby">ticket.price=(63.00)
ticket.price = 63.00
</pre>
</div>

<p>
The second version is syntactic sugar for the first one. It is
important to understand and remember. <code>=</code> is a method (like
other operators) and can be overloaded.
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> setter methods</h3>
<div class="outline-text-3" id="text-3-4">
<p>
They behave like assignment. They return the value of the
expression rather than the last expression evaluated during
execution (for example when your assignement methods returns a
string "Hah ha!")
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Ticket</span>
  <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">price=</span>(price)
    <span style="color: #a0522d;">@price</span> = price
    <span style="color: #a020f0;">return</span> <span style="color: #8b2252;">'ahah'</span>
  <span style="color: #a020f0;">end</span>

<span style="color: #a020f0;">end</span>

<span style="color: #a020f0;">if</span> (<span style="color: #228b22;">Ticket</span>.new.price = 65) == 65 <span style="color: #b22222;"># </span><span style="color: #b22222;">true</span>
  <span style="color: #483d8b;">puts</span> <span style="color: #8b2252;">'my return value is 65'</span> <span style="color: #b22222;">#</span><span style="color: #b22222;">gets printed</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> attributes</h3>
<div class="outline-text-3" id="text-3-5">
<table>


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">method name</td>
<td class="left">effect</td>
<td class="left">example</td>
<td class="left">equivalent code</td>
</tr>

<tr>
<td class="left"><code>attr_reader</code></td>
<td class="left">creates a read method</td>
<td class="left"><code>attr_reader :venue</code></td>
<td class="left">def venue</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">@venue</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">end</td>
</tr>

<tr>
<td class="left"><code>attr_writer</code></td>
<td class="left">creates a writer method</td>
<td class="left"><code>attr_writer :price</code></td>
<td class="left">def price=(price)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">@price = price</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">end</td>
</tr>

<tr>
<td class="left"><code>attr_accessor</code></td>
<td class="left">creates reader and writer method</td>
<td class="left"><code>attr_accessor :price</code></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>attr</code></td>
<td class="left">creates a reader method</td>
<td class="left"><code>attr :venue</code></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">and a writer method if the second argument is true</td>
<td class="left"><code>attr :price, true</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Those family methods are defined in <i>Module</i>
</p>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Subclass</h3>
<div class="outline-text-3" id="text-3-6">
<p>
<code>&lt;</code> designates a subclass.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Publication</span>
<span style="color: #a020f0;">end</span>

<span style="color: #a020f0;">class</span> <span style="color: #228b22;">Magazine</span> &lt; <span style="color: #228b22;">Publication</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>
