notes/ruby.html

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Superclass &amp; Modules</h3>
<div class="outline-text-3" id="text-3-7">
<p>
A Ruby <i>class</i> can have only one <i>superclass</i> (<i>single
inheritance</i>).
Ruby provides modules that you can <i>mix in</i> your class's family
tree to provide as many methods for your objects as you need.
</p>
</div>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> <code>BasicObject</code>, <code>Object</code> &amp; <code>Kernel</code></h3>
<div class="outline-text-3" id="text-3-8">
<p>
<code>BasicObject</code> comes before <code>Object</code> in the ruby family tree.
<code>BasicObject</code> offers a blank state object. an object with
almost no methods. At the time of writing (Ruby 2.1),
<code>BasicObject</code> has 7 instance methods and <code>Object</code>
about 55.
</p>

<p>
<code>Kernel</code> module contains the majority of the methods common to
all objects
</p>

<p>
<code>BasicObject</code>, <code>Object</code> &amp; <code>Kernel</code> are written in C. Here is a
Ruby mockup of their relationship
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">BasicObject</span>
  <span style="color: #b22222;"># </span><span style="color: #b22222;">7 methods</span>
<span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">module</span> <span style="color: #228b22;">Kernel</span>
  <span style="color: #b22222;"># </span><span style="color: #b22222;">over 100 method definitions</span>
<span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">Object</span> &lt; <span style="color: #228b22;">BasicObject</span>
  <span style="color: #483d8b;">include</span> <span style="color: #228b22;">Kernel</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> Methods &amp; Constant notation</h3>
<div class="outline-text-3" id="text-3-9">
<ul class="org-ul">
<li><code>Ticket#price</code>: instance method <code>price</code> in the <i>class</i>
     <code>Ticket</code>
</li>
<li><code>Ticket.most_expensive</code>: <i>class</i> method <code>most_expensive</code> in
the class Ticket
</li>
<li><code>Ticket::most_expensive</code>: <i>class</i> method <code>most_expensive</code> in
the class Ticket
</li>
<li><code>Ticket::VENUES</code>: constant <code>VENUES</code> in class <code>Ticket</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> Constants</h3>
<div class="outline-text-3" id="text-3-10">
<p>
It is possible to perform an assingment on a constant you
already assigned.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #228b22;">A</span> = 1
<span style="color: #228b22;">A</span> = 2
</pre>
</div>

<p>
You will get a warning
</p>

<div class="org-src-container">

<pre class="src src-ruby">venues = <span style="color: #228b22;">Ticket</span>::<span style="color: #228b22;">VENUES</span>
venues &lt;&lt; <span style="color: #8b2252;">'High School Gym'</span>
</pre>
</div>

<p>
no warning because there is no redefinition of a constant. We
are modifying an array and array has no knowleged it has been
assigned to a constant.
</p>
</div>
</div>

<div id="outline-container-sec-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> <code>inspect</code></h3>
<div class="outline-text-3" id="text-3-11">
<p>
You can override it and have useful info about your custom class.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Modules and program organization</h2>
<div class="outline-text-2" id="text-4">
<p>
Modules don't have instances. It follows that entities or things
are best modeled in classes and characteristics or properties
are best encapsulated in modules.
</p>

<p>
The <i>class</i> of <code>Class</code> and <code>Module</code> is <i>class</i>. The <i>superclass</i> of
<code>Class</code> is <code>Module</code>. The <i>superclass</i> of <code>Module</code> is object.
</p>

<p>
modules get <i>mixed in</i> to classes using <code>include</code> or <code>prepend</code>.
A <i>mixed in</i> module is referred as a <i>mix in</i>.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">ModuleTester</span>
  <span style="color: #483d8b;">include</span> <span style="color: #228b22;">MyFirstModule</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>

<p>
The main difference between inheriting from a <i>class</i> and
<i>modules</i> is that you can <i>mix in</i> more that one module
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Class and Module naming</h3>
<div class="outline-text-3" id="text-4-1">
<p>
It is common to have /class/’s name as noun and /module/’s as an adjective
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Stack</span>
  <span style="color: #483d8b;">include</span> <span style="color: #228b22;">Stacklike</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <code>method_missing</code></h3>
<div class="outline-text-3" id="text-4-2">
<p>
Get called as a last resort for unmatched messages. You can
override <code>method_missing</code>
</p>

<p>
A good example of a <code>method_missing</code> override:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Person</span>
  <span style="color: #a020f0;">def</span> <span style="color: #a0522d;">self</span>.<span style="color: #0000ff;">method_missing</span>(m, *args)
    method = m.to_s
    <span style="color: #a020f0;">if</span> method.start_with?(<span style="color: #8b2252;">'all_with_'</span>)
      <span style="color: #b22222;"># </span><span style="color: #b22222;">Handle request here"</span>
    <span style="color: #a020f0;">else</span>
      <span style="color: #a020f0;">super</span>
    <span style="color: #a020f0;">end</span>
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> including a module several times</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Reincluding a <i>module</i> does not do anything as the modle is
already in the search path. In the following example, if <i>N</i> and
<i>M</i> have some methods with the same name, the method defined in
<i>N</i> will be called.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">C</span>
  <span style="color: #483d8b;">include</span> <span style="color: #228b22;">M</span>
  <span style="color: #483d8b;">include</span> <span style="color: #228b22;">N</span>
  <span style="color: #483d8b;">include</span> <span style="color: #228b22;">M</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> <code>prepend</code></h3>
<div class="outline-text-3" id="text-4-4">
<p>
<code>prepend</code> appeared with Ruby 2. The difference between
<code>include</code> and <code>prepend</code> is that when you <code>prepend a module</code>,
the object looks in the module first instead of looking in the
class.
</p>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> method lookup summary</h3>
<div class="outline-text-3" id="text-4-5">
<p>
To look for a method, an object looks in:
</p>

<ol class="org-ol">
<li>Modules prepended
</li>
<li>It’s class
</li>
<li>Modules in it class
</li>
<li>Modules prepended to its superclass
</li>
<li>It’s class superclass
</li>
<li>Modules included in its superclass
</li>
<li>and so on up to <code>BasicObject</code>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> <code>super</code></h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>Called with no arguments, <code>super</code> automatically forwards
arguments passed to the method from which it’s called.
</li>
<li>with an empty argument list <code>super()</code> sends no
argument
</li>
<li>called with specific arguments <code>super(a, b, c)</code> sends those
arguments
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Nesting modules and classes</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">module</span> <span style="color: #228b22;">Tools</span>
  <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Hammer</span>
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>

<p>
Used to separate namespaces for classes, modules and methods.
However if you see a construct like <code>Tools::Hammer</code> you can't
say from that construct if <code>Hammer</code> is a class or a module. You
know it through the documentation or because you wrote the
code. The notation in itself does not tell you everything.
</p>
</div>
</div>
</div>
