notes/ruby.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> The default Object (self), scope &amp; visibility</h2>
<div class="outline-text-2" id="text-5">
<table>


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Context</th>
<th scope="col" class="left">Example</th>
<th scope="col" class="left">Which object is self?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Top level of program</td>
<td class="left">Any code</td>
<td class="left"><code>main</code></td>
</tr>

<tr>
<td class="left">Class definition</td>
<td class="left">class C</td>
<td class="left">class object C</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">self</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Module definition</td>
<td class="left">module M</td>
<td class="left">module object M</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">self</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Method definitions</td>
<td class="left">1. Top level</td>
<td class="left">whatever object is self</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">def method<sub>name</sub></td>
<td class="left">when the method is called</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">self</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">2. class instance-method</td>
<td class="left">An instance of C</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">class C</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">def method<sub>name</sub></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">self</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">3. module instance-method</td>
<td class="left">- Individual oject extented by M</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">module M</td>
<td class="left">- Instance of class that mixes in M</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">def method<sub>name</sub></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">self</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">4. Singleton method on an object</td>
<td class="left">Obj</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">def obj.method<sub>name</sub></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">self</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Don't hard code class names.</h3>
<div class="outline-text-3" id="text-5-1">
<p>
It is bad in case you want to rename  your class. Instead use self
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">C</span>
  <span style="color: #a020f0;">def</span> <span style="color: #228b22;">C</span>.<span style="color: #0000ff;">y</span> <span style="color: #b22222;"># </span><span style="color: #b22222;">bad</span>
  <span style="color: #a020f0;">end</span>

  <span style="color: #a020f0;">def</span> <span style="color: #a0522d;">self</span>.<span style="color: #0000ff;">x</span> <span style="color: #b22222;"># </span><span style="color: #b22222;">good</span>
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> instance variables</h3>
<div class="outline-text-3" id="text-5-2">
<p>
every instance variable belongs to whatever object is the
current object (/self) at that point.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">C</span>
  <span style="color: #483d8b;">p</span> <span style="color: #a0522d;">self</span>
  <span style="color: #a0522d;">@v</span> = <span style="color: #8b2252;">"top level instance variable "</span>
  <span style="color: #483d8b;">p</span> <span style="color: #a0522d;">@v</span>

  <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">show_v</span>
    <span style="color: #483d8b;">p</span> <span style="color: #a0522d;">self</span>
    <span style="color: #483d8b;">p</span> <span style="color: #a0522d;">@v</span>
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>

c = <span style="color: #228b22;">C</span>.new
c.show_v
</pre>
</div>

<p>
will return
</p>

<pre class="example">
C
"top level instance variable"
#&lt;C:0x007fe37388d9d0&gt;
nil
</pre>

<p>
The two variables <code>@v</code> are different
</p>
</div>
</div>


<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> built-in classes</h3>
<div class="outline-text-3" id="text-5-3">
<p>
You can create you own <i>string</i> class
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">MyClass</span>
  <span style="color: #a020f0;">class</span> <span style="color: #228b22;">String</span>

  <span style="color: #a020f0;">end</span>
  <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">initialize</span>
    <span style="color: #228b22;">String</span>.new
<span style="color: #a020f0;">end</span>
</pre>
</div>

<p>
Here the <code>String</code> used will be the new one defined in
<code>MyClass</code>. To use the build in Ruby <code>String</code> you can use <code>::String.new</code>.
<code>::</code> in front of a constant means “start the search for this at
the top level”
</p>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> class variables (@@)</h3>
<div class="outline-text-3" id="text-5-4">
<p>
class variables are class-hierarchy scoped.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Parent</span>
  <span style="color: #a0522d;">@@value</span> = 100
<span style="color: #a020f0;">end</span>

<span style="color: #a020f0;">class</span> <span style="color: #228b22;">Child</span> &lt; <span style="color: #228b22;">Parent</span>
  <span style="color: #a0522d;">@@value</span> = 200
<span style="color: #a020f0;">end</span>

<span style="color: #a020f0;">class</span> <span style="color: #228b22;">Parent</span>
  <span style="color: #483d8b;">puts</span> <span style="color: #a0522d;">@@value</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>

<p>
Here 200 will get printed
</p>
</div>
</div>


<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> public, private, protected</h3>
<div class="outline-text-3" id="text-5-5">
<p>
you either do
<code>private :first_method, :second_method, :third_method</code>. To make
those three methods private. Or Use <code>private</code> as a switch
without arguments then ll methods below <code>private</code> in your class
will be private.
</p>
</div>

<div id="outline-container-sec-5-5-1" class="outline-4">
<h4 id="sec-5-5-1"><span class="section-number-4">5.5.1</span> private setter methods</h4>
<div class="outline-text-4" id="text-5-5-1">
<p>
you can omit <code>self</code> when defining private access. It won't
clash with an ipothetic class variable. Ruby is smart enough
to understand what you mean.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Dog</span>
  <span style="color: #483d8b;">attr_reader</span> <span style="color: #008b8b;">:age</span>, <span style="color: #008b8b;">:dog_years</span>
  <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">dog_years=</span>(years)
    <span style="color: #a0522d;">@dog_years</span> = years
  <span style="color: #a020f0;">end</span>
  <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">age=</span>(years)
    <span style="color: #a0522d;">@age</span> = years
    <span style="color: #a0522d;">self</span>.dog_years = years * 7 <span style="color: #b22222;"># </span><span style="color: #b22222;">= @dog_years = years * 7</span>
  <span style="color: #a020f0;">end</span>
  <span style="color: #483d8b;">private</span> <span style="color: #008b8b;">:dog_years=</span>
<span style="color: #a020f0;">end</span>

luigi = <span style="color: #228b22;">Dog</span>.new
luigi.age = 10
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> top level method</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">talk</span>
  <span style="color: #483d8b;">puts</span> <span style="color: #8b2252;">'hello'</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>

<p>
is equivalent to
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Object</span>
  <span style="color: #483d8b;">private</span>
  <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">talk</span>
    <span style="color: #483d8b;">puts</span> <span style="color: #8b2252;">'hello'</span>
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Control-flow techniques</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> if</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">if</span> x &gt; 10
  <span style="color: #483d8b;">puts</span> x
<span style="color: #a020f0;">end</span>

<span style="color: #a020f0;">if</span> x &gt; 10 <span style="color: #a020f0;">then</span> <span style="color: #483d8b;">puts</span> x <span style="color: #a020f0;">end</span>

<span style="color: #a020f0;">if</span> x &gt; 10; <span style="color: #483d8b;">puts</span> x; <span style="color: #a020f0;">end</span>

<span style="color: #483d8b;">puts</span> x <span style="color: #a020f0;">if</span> x &gt; 10
</pre>
</div>

<p>
If an <code>if</code> statement does not suceed it returns <code>nil</code>
It it succeeds the entite statement evaluates to whatever is
represented by the code in the successful branch.
</p>
</div>
</div>
