notes/ruby.org
** unless
   same as ~if not~ or ~if!~

** case
   At most one match will succeed and have its code executed.
   You can put more than one possible match in a single ~when~

#+BEGIN_SRC ruby
  case answer
  when 'y', 'yes'
    puts 'affirmative!'
  when 'n', 'no'
    puts 'negative!'
  else
    puts 'not sure'
  end
#+END_SRC

** /===/
   For ~String~ and any object that does not ovveride it, ~===~
   works the same as ~==~. Every class can define its own ~===~
   method. It is used in /case when/ equality logic.

** loop

   loop is an iterator. In Ruby an iterator is a method that
   expects you to provide a code block.

#+BEGIN_SRC ruby
  loop { puts 'looping forever' }

  n = 1
  loop do
    n += 1
    next unless n == 10
    break
  end
#+END_SRC

   Here is how we can write loop

#+BEGIN_SRC ruby
  def my_loop
    yield while true
  end
#+END_SRC

** while and until modifiers

#+BEGIN_SRC ruby
  n += 1 until n == 10
  n += 1 while n < 10
#+END_SRC

** for

#+BEGIN_SRC ruby
  numbers = [0, 10, 20, 30, 40, 50]
  for n in numbers
    puts n
  end
#+END_SRC

** curly braces vs do/end code block

   The difference between the two is a difference in precedence

#+BEGIN_SRC ruby
  puts [1, 2, 3].map { |n| n * 10 }
  # is like
  puts ([1, 2, 3].map { |n| n * 10 })
#+END_SRC
   will ouput 10, 20 , 30

#+BEGIN_SRC ruby
  puts [1, 2, 3].map do |n| n * 10 end
  # is like
  puts ([1, 2, 3].map) do |n| n * 10 end
  # is like
  puts [1, 2, 3].map
#+END_SRC
   will output an enumerator

** each and map

   - ~each~ returns its receiver
   - ~map~ returns a new array


**  Block parameters and scope

    If you have a variable of a given name in scope and also use
    that name as one of your block parameters, then the two
    variables are not the same as each other.
    You can use this to your advantage to make sure a temporary
    variable inside a block does not reuse a variable from outside
    the block

#+BEGIN_SRC ruby
  x = "original x"
  3.times do |i;x|
    x = i
  end
  x
#+END_SRC

#+RESULTS:
: original x

    ~;~ indicates the block needs its own x.

** rescue

#+BEGIN_SRC ruby
  begin
    #some code
  rescue ArgumentError => e
  #rescue code
    puts e.backtrace
    puts e.message
  ensure
    #make sure this runs
  end
#+END_SRC

   if you put rescue at the end of a method you don't need to say
   begin explicitely. Recue will govern the entire method block

#+BEGIN_SRC ruby
  def method_name
    puts 'hello'
    rescue
    puts 'rescued'
  end
#+END_SRC

* Built in essentials
** Literal constructors
   Special notatoin instead of a call to ~new~ to create a new
   object of that class.

   | Class         | Examples(s)              |
   |---------------+--------------------------|
   | String        | "Hello"                  |
   |               | 'hello'                  |
   | Symbol        | :hello                   |
   | Array         | [1, 2, 3, 4]             |
   | Hash          | { 'Hello' -> 'Bonjour' } |
   | Range         | 0..9                     |
   |               | 0...10                   |
   | Regexp        | /([a-z]+)/               |
   | Proc (lambda) | ->(x, y) { x * y }       |

** Shortcut operators (syntactic sugar)

   Ruby has shortcut operators like ~||=~, ~+=~, ~-=~, ~*=~, ~&=~
   (bitwise AND), ~|=~ (bitwise OR), ~^=~ (bitwise EXCLUSIVE OR)

   If you define a ~+~ method you can use the ~+=~ syntax.
   Similarly if you define a ~-~ method you can use the ~-=~ syntax
   and so on for all other operators.

   Shortcut operators are:
   | Category      | Operators          |
   |---------------+--------------------|
   | Arithmetic    | ~+ - * / % **~     |
   | Data          | ~[] []= <<~        |
   | Comparison    | ~<=> == > < >= <=~ |
   | Case equality | ~===~              |
   | Bitwise       | \vert & ^              |

** Unary operators

   ~+~ and ~-~ as in ~+1~ and ~-1~ can be customized

#+BEGIN_SRC ruby
  def +@
  end

  def -@
  end
#+END_SRC

   You can customize ~!~ which also gives you ~not~

#+BEGIN_SRC ruby
  def !
    #some code
  end
#+END_SRC

