notes/ruby.org
** dangerous_method!

   When you have a ! at the end of a method name. It usually means
   this methods permanently modifies its reveiver. But It is not
   always the case. Expecially when ! methods don't have nonbang
   equivalent.
   Ex: ~String.clear~. No ! but it changes the receiver.

   + Don't use ! except in M/M! methods pars
   + Don't equate ! with destructive behavior or vice versa
     It can mean something else.

** conversions

   + ~to_s~
     used by certain methods — like ~puts~ — and string interpolation. If you write your
     own ~to_s~ ofr a class you can take advantage of it.
   + ~to_a~ and ~*~
     The ~*~ turns any array into the equivalent of a bare list
     #+BEGIN_SRC ruby
       [*[1, 2, 3, 4, 5]] == [1, 2, 3, 4, 5]
     #+END_SRC

     #+RESULTS:
     : true
   + ~to_i~, ~Integer~, ~to_f~, ~Float~
     To convert integers and float. ~Integer~ and ~Float~ are
     stricter versions
   + Role-playing
     + ~to_str~
       If you want to be able to add a string with your object,
       you can define ~to_str~ for your object. ~to_str~ is used
       by ruby for /String#+/ and /String#<</
     + ~to_ary~
       To use ruby methods like /Array#concat/

** Comparisons
   if you define ~==~, you automatically define ~!=~ for your
   object.
   ~==~ and ~eql?~ are usually redefined to do meaningful work.
   ~equal?~ is usually left alone to check wether two objects are
   exactly the same object.

*** Comparable module
    If you want objects of ~MyClass~ to have the full comparison
    suite:

    + mixin ~Comparable~
    + Define ~<=>~ (spaceship operator) for your class
      ~<=>~ can return -1 (less than), 0 (equal) and 1 (greater
      than)
** Inspecting

   ~String.methods.sort~
   ~String.instance_methods.sort~
   Use ~String.instance_methods(false).sort~ to not see instance
   methods provided by class’s ancestors.

#+BEGIN_SRC ruby
  str = 'ok'
  def str.shout
    self.upcase
  end
  str.singleton_methods
#+END_SRC

#+RESULTS:
| :shout |
** ~try_convert~
   ~try_convert~ looks for a conversion method on argument object.
   If it exists, it gets called, if not it returns ~nil~. If the
   object returned class is different that the class to which
   conversion is attempted it returns a fatal error.

#+BEGIN_SRC ruby
  obj = Object.new
  Array.try_convert(obj)
#+END_SRC

#+RESULTS:
: nil

#+BEGIN_SRC ruby
  obj = Object.new
  def obj.to_ary
    [1, 2, 3]
  end
  Array.try_convert(obj)
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |

* Strings, symbols and other scalar objects
  A string literal is enclosed between ~"~ or ~'~ quotation marks
  string interpolation does not work with ~'~
** String interpolation

   #+BEGIN_SRC ruby
     puts "I’m #{first_name}"
   #+END_SRC


   You can also create a string with ~%charDELIMITERtextDELIMITER~. ~char~ can be
   + ~%q~. Creates a single-quote string
   + ~%Q~. Creates a double-quote string
   + ~%~. Creates a double-quote string

     delimiter can be any of two same character as long as you
     match it on both end of the string. It can be a pair of
     braces too.

** “Here” document or /here-doc/

#+BEGIN_SRC ruby
  too = 'too'
  text = <<EOM
  This text is splendid.
  Full of words, lines & punctuations.
  And with interpolation #{too}
  EOM
#+END_SRC

#+RESULTS:
: This text is splendid.
: Full of words, lines & punctuations.
: And with interpolation too

   You can add single quotes for single quoted /here-doc/

#+BEGIN_SRC ruby
  var_too = 'too'
  text = <<'EOM'
  No interpolation #{var_too}
  EOM
#+END_SRC

#+RESULTS:
: No interpolation #{var_too}

   /EOM/ does not have to be the last thing on the line

#+BEGIN_SRC ruby
  a = <<EOM.to_i * 10
  5
  EOM
#+END_SRC

#+RESULTS:
: 50

#+BEGIN_SRC ruby
  array = [1, 2, 3, <<EOM.to_i, 5]
  4
  EOM
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 4 | 5 |

#+BEGIN_SRC ruby
  long_args(a, b, <<EOM)
  http://supersupersupersupersupersupersuperlongurl.com
  EOM
#+END_SRC

** Basic string manipulation

*** Selection
   + negative numbers index from the end of the string
#+BEGIN_SRC ruby
  string = "ruby is cool"
  string[-1]
#+END_SRC

#+RESULTS:
: l
   + You can ask for a substring
#+BEGIN_SRC ruby
  string = "ruby is cool"
  string[5, 7]
#+END_SRC

#+RESULTS:
: is cool

   + You can provide a range
#+BEGIN_SRC ruby
  string = "ruby is cool"
 string[5..11]
#+END_SRC

#+RESULTS:
: is cool

#+BEGIN_SRC ruby
  string = "ruby is cool"
  string[5...11]
#+END_SRC

#+RESULTS:
: is coo
   + You can use substring search
#+BEGIN_SRC ruby
  string = "ruby is cool"
  string['is']
#+END_SRC

#+RESULTS:
: is
  + And regular expression
#+BEGIN_SRC ruby
  string = "ruby is cool"
  string[/co+l/]
#+END_SRC

#+RESULTS:
: cool

*** changing strings
  + You can change part of a string using the same selection arguments
#+BEGIN_SRC ruby
  string = "ruby is cool"
  string['cool'] = 'great'
  string
#+END_SRC

#+RESULTS:
: ruby is great

  + You can combine strings
    With ~+~ the string you get back is always a new string. With
    ~<<~ we append permanently. No new string.

