notes/ruby.html

<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> dangerous<sub>method</sub>!</h3>
<div class="outline-text-3" id="text-7-4">
<p>
When you have a ! at the end of a method name. It usually means
this methods permanently modifies its reveiver. But It is not
always the case. Expecially when ! methods don't have nonbang
equivalent.
Ex: <code>String.clear</code>. No ! but it changes the receiver.
</p>

<ul class="org-ul">
<li>Don't use ! except in M/M! methods pars
</li>
<li>Don't equate ! with destructive behavior or vice versa
It can mean something else.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> conversions</h3>
<div class="outline-text-3" id="text-7-5">
<ul class="org-ul">
<li><code>to_s</code>
used by certain methods — like <code>puts</code> — and string interpolation. If you write your
own <code>to_s</code> ofr a class you can take advantage of it.
</li>
<li><code>to_a</code> and <code>*</code>
     The <code>*</code> turns any array into the equivalent of a bare list
<div class="org-src-container">

<pre class="src src-ruby">[*[1, 2, 3, 4, 5]] == [1, 2, 3, 4, 5]
</pre>
</div>
</li>
<li><code>to_i</code>, <code>Integer</code>, <code>to_f</code>, <code>Float</code>
To convert integers and float. <code>Integer</code> and <code>Float</code> are
stricter versions
</li>
<li>Role-playing
<ul class="org-ul">
<li><code>to_str</code>
If you want to be able to add a string with your object,
you can define <code>to_str</code> for your object. <code>to_str</code> is used
by ruby for <i>String#+</i> and <i>String#&lt;&lt;</i>
</li>
<li><code>to_ary</code>
       To use ruby methods like <i>Array#concat</i>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> Comparisons</h3>
<div class="outline-text-3" id="text-7-6">
<p>
if you define <code>==</code>, you automatically define <code>!=</code> for your
object.
<code>==</code> and <code>eql?</code> are usually redefined to do meaningful work.
<code>equal?</code> is usually left alone to check wether two objects are
exactly the same object.
</p>
</div>

<div id="outline-container-sec-7-6-1" class="outline-4">
<h4 id="sec-7-6-1"><span class="section-number-4">7.6.1</span> Comparable module</h4>
<div class="outline-text-4" id="text-7-6-1">
<p>
If you want objects of <code>MyClass</code> to have the full comparison
suite:
</p>

<ul class="org-ul">
<li>mixin <code>Comparable</code>
</li>
<li>Define <code>&lt;=&gt;</code> (spaceship operator) for your class
<code>&lt;=&gt;</code> can return -1 (less than), 0 (equal) and 1 (greater
than)
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> Inspecting</h3>
<div class="outline-text-3" id="text-7-7">
<p>
<code>String.methods.sort</code>
<code>String.instance_methods.sort</code>
Use <code>String.instance_methods(false).sort</code> to not see instance
methods provided by class’s ancestors.
</p>

<div class="org-src-container">

<pre class="src src-ruby">str = <span style="color: #8b2252;">'ok'</span>
<span style="color: #a020f0;">def</span> str.<span style="color: #0000ff;">shout</span>
  <span style="color: #a0522d;">self</span>.upcase
<span style="color: #a020f0;">end</span>
str.singleton_methods
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-8" class="outline-3">
<h3 id="sec-7-8"><span class="section-number-3">7.8</span> <code>try_convert</code></h3>
<div class="outline-text-3" id="text-7-8">
<p>
<code>try_convert</code> looks for a conversion method on argument object.
If it exists, it gets called, if not it returns <code>nil</code>. If the
object returned class is different that the class to which
conversion is attempted it returns a fatal error.
</p>

<div class="org-src-container">

<pre class="src src-ruby">obj = <span style="color: #228b22;">Object</span>.new
<span style="color: #228b22;">Array</span>.try_convert(obj)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-ruby">obj = <span style="color: #228b22;">Object</span>.new
<span style="color: #a020f0;">def</span> obj.<span style="color: #0000ff;">to_ary</span>
  [1, 2, 3]
<span style="color: #a020f0;">end</span>
<span style="color: #228b22;">Array</span>.try_convert(obj)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Strings, symbols and other scalar objects</h2>
<div class="outline-text-2" id="text-8">
<p>
A string literal is enclosed between ~"~ or ~'~ quotation marks
string interpolation does not work with ~'~
</p>
</div>
<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> String interpolation</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #483d8b;">puts</span> <span style="color: #8b2252;">"I&#8217;m </span><span style="color: #a0522d;">#{first_name}</span><span style="color: #8b2252;">"</span>
</pre>
</div>


<p>
You can also create a string with <code>%charDELIMITERtextDELIMITER</code>. <code>char</code> can be
</p>
<ul class="org-ul">
<li><code>%q</code>. Creates a single-quote string
</li>
<li><code>%Q</code>. Creates a double-quote string
</li>
<li><code>%</code>. Creates a double-quote string

<p>
delimiter can be any of two same character as long as you
match it on both end of the string. It can be a pair of
braces too.
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> “Here” document or <i>here-doc</i></h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">

<pre class="src src-ruby">too = <span style="color: #8b2252;">'too'</span>
text = <span style="color: #8b2252;">&lt;&lt;EOM</span>
<span style="color: #8b2252;">This text is splendid.</span>
<span style="color: #8b2252;">Full of words, lines &amp; punctuations.</span>
<span style="color: #8b2252;">And with interpolation </span><span style="color: #a0522d;">#{too}</span>
<span style="color: #8b2252;">EOM</span>
</pre>
</div>

<p>
You can add single quotes for single quoted <i>here-doc</i>
</p>

<div class="org-src-container">

<pre class="src src-ruby">var_too = <span style="color: #8b2252;">'too'</span>
text = &lt;&lt;<span style="color: #8b2252;">'EOM'</span>
<span style="color: #8b2252;">No interpolation </span><span style="color: #a0522d;">#{var_too}</span>
<span style="color: #8b2252;">EOM</span>
</pre>
</div>

<p>
<i>EOM</i> does not have to be the last thing on the line
</p>

<div class="org-src-container">

<pre class="src src-ruby">a = <span style="color: #8b2252;">&lt;&lt;EOM</span>.to_i * 10
<span style="color: #8b2252;">5</span>
<span style="color: #8b2252;">EOM</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-ruby">array = [1, 2, 3, <span style="color: #8b2252;">&lt;&lt;EOM</span>.to_i, 5]
<span style="color: #8b2252;">4</span>
<span style="color: #8b2252;">EOM</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-ruby">long_args(a, b, <span style="color: #8b2252;">&lt;&lt;EOM</span>)
<span style="color: #8b2252;">http://supersupersupersupersupersupersuperlongurl.com</span>
<span style="color: #8b2252;">EOM</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Basic string manipulation</h3>
<div class="outline-text-3" id="text-8-3">
</div><div id="outline-container-sec-8-3-1" class="outline-4">
<h4 id="sec-8-3-1"><span class="section-number-4">8.3.1</span> Selection</h4>
<div class="outline-text-4" id="text-8-3-1">
<ul class="org-ul">
<li>negative numbers index from the end of the string
</li>
</ul>
<div class="org-src-container">

<pre class="src src-ruby">string = <span style="color: #8b2252;">"ruby is cool"</span>
string[-1]
</pre>
</div>
<ul class="org-ul">
<li>You can ask for a substring
</li>
</ul>
<div class="org-src-container">

<pre class="src src-ruby">string = <span style="color: #8b2252;">"ruby is cool"</span>
string[5, 7]
</pre>
</div>

<ul class="org-ul">
<li>You can provide a range
</li>
</ul>
<div class="org-src-container">

<pre class="src src-ruby"> string = <span style="color: #8b2252;">"ruby is cool"</span>
string[5..11]
</pre>
</div>

<div class="org-src-container">

<pre class="src src-ruby">string = <span style="color: #8b2252;">"ruby is cool"</span>
string[5...11]
</pre>
</div>
<ul class="org-ul">
<li>You can use substring search
</li>
</ul>
<div class="org-src-container">

<pre class="src src-ruby">string = <span style="color: #8b2252;">"ruby is cool"</span>
string[<span style="color: #8b2252;">'is'</span>]
</pre>
</div>
<ul class="org-ul">
<li>And regular expression
</li>
</ul>
<div class="org-src-container">

<pre class="src src-ruby">string = <span style="color: #8b2252;">"ruby is cool"</span>
string[<span style="color: #8b2252;">/co+l/</span>]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-3-2" class="outline-4">
<h4 id="sec-8-3-2"><span class="section-number-4">8.3.2</span> changing strings</h4>
<div class="outline-text-4" id="text-8-3-2">
<ul class="org-ul">
<li>You can change part of a string using the same selection arguments
</li>
</ul>
<div class="org-src-container">

<pre class="src src-ruby">string = <span style="color: #8b2252;">"ruby is cool"</span>
string[<span style="color: #8b2252;">'cool'</span>] = <span style="color: #8b2252;">'great'</span>
string
</pre>
</div>

<ul class="org-ul">
<li>You can combine strings
With <code>+</code> the string you get back is always a new string. With
<code>&lt;&lt;</code> we append permanently. No new string.
</li>
</ul>
</div>
</div>
</div>
