notes/ruby.org
** Querying strings

   + ~String#include?('cool')~
   + ~String#start_with?('ruby')~
   + ~String#empty?~
   + ~String#size~
   + ~String#count('a')~, range of letters ~String#count('a-c')~ and you can
     combine arguments ~String#count('a-c', '^b' )~ (any letters from a
     to c that is not b)
   + ~String#index('cool')~
   + ~String#ord~ gives ordinal code of first character. Reverse
     operation is ~String#chr~

** String comparison
   + ~==~ for equality of content
   + ~String#equal?~ for equality of object

** transformations

   + ~String#upcase~
   + ~String#downcase~
   + ~String#upcase~
   + ~String#swapcase~
   + ~String#capitalize~
   + ~String#rjust(5)~ and ~String#ljust(5)~ add padding to the
     right of left with either blank spaces or a char if you add a
     second char parameter.
   + ~String#center(5)~. Same as /rjust/ and /ljust/ for parameters
   + ~String#strip~, ~String#lstrip~ & ~String#rstrip~ removes
     whitespaces
   + ~String#chop~ to remove a character at the end of the string
   + ~String#chomp~ to remove a newline character. You can target
     other characters or strings by providing an argument ~String#chomp('ab')~
   + ~String#clear~ clears the receiver. No ! but it changes the receiver.
   + ~String#replace~
   + ~String#delete~ same rules for arguments as with count.
   + ~String#succ~ increment letters in a string. Handy when you
     need a batch of generated unique strings.

** Conversions
   ~to_sum~, ~to_f~, ~to_i~
   You can provide a parameter to ~to_i~ to specify a base.
   ~.oct~ for octal and ~.hex~ for hexadecimal.

** Encoding
   In Ruby 2 the default encoding for ruby scripts is UTF-8.

   you can use ~__ENCODING__~ to know the encoding value. Directly
   in the file. If you run this command on the command line
   through ~$ ruby -e 'puts __ENCODING__~ you will get the current
   locale setting which can differ.

   You can use a magic comment at the top of the file ~# encoding:
   encoding_Value~ to change the encoding of a file.

*** Strings

    ~String#encoding~ to get the encoding.

    You can encode a string in a different encoding as long as the
    conversion is permitted. This is called transcoding.
    ~String.encode('US-ASCII')~. The bang version changes the
    encoding of the string permanently.

    You can force an encoding ~String#force_encoding('US-ASCII')~

    You can represent characters with escape sequence. ~\x~ for
    two digit hexadecimal numbers representing a byte. ~\u~
    followed by a UTF-8 code to insert the corresponding
    character. By doing this you can change a string encoding to
    UTF-8 (if it was in ASCII and the character inserted does not
    exist in ASCII).

** Symbols

   literal constructor ~:symbol_name~

   + symbols are immutable
   + symbols are unique. Thus there is no point in having
     constructor for them. They are like integers in that respect

   When you bin a variable to a symbol you bind its value, not a
   reference to it.

   You can list all symbols with ~Symbol.all_symbols~

   If you want to check if a symbol exist you can use /grep/

#+BEGIN_SRC ruby
  Symbol.all_symbols.grep(/abc/)
#+END_SRC

   Don't use ~include?(:abc)~ because this very act creates the
   symbol!

   Symbols appears most of the times in method arguments and hash
   keys. They are better for hash keys because ruby can process
   them faster and they —look good— as hash keys. Ruby also use a
   convenient way to use symbol as hash keys

   The following two are equivalent
#+BEGIN_SRC ruby
  hash = { :name => 'David', :age => 35 }
  hash = { name: 'David', age: 35}
#+END_SRC


** Numerical object

   At the top /Numeric/.
   /Float/ and /Integer/ below.
   /Fixnum/ and /Bignum/ below Integer. Ruby handles the
   conversion automatically when you need /Bignum/.

   With divisions, when you want integers you have to specify it.

#+BEGIN_SRC ruby
  3 / 2
#+END_SRC

#+RESULTS:
: 1


#+BEGIN_SRC ruby
  3 / 2.0
#+END_SRC

#+RESULTS:
: 1.5

   Hexadecimals with leading 0x

#+BEGIN_SRC ruby
  0x12 + 10
#+END_SRC

#+RESULTS:
: 28

   Octals when leading 0

#+BEGIN_SRC ruby
  012 + 10
#+END_SRC

#+RESULTS:
: 20


** Times and dates

   3 classes. /Time/, /Date/ and /DateTime/

#+BEGIN_SRC ruby
  require 'time'
  require 'date' #provides both Date and Datetime
#+END_SRC

   You can query for ~leap?~ years and ~dst?~ (daylight saving
   time)
   There is an ~strftime~ methods to format
   Precooked format /rfc2822/ for email and ~httpdate~ (RFC 2616
   standard).
   You can use ~upto~ and ~downto~ to iterate over a range of them

#+BEGIN_SRC ruby
  require 'date'
  d = Date.today
  next_week = d + 7

  d.upto(next_week)
#+END_SRC

#+RESULTS:
: #<Enumerator: #<Date: 2014-10-30 ((2456961j,0s,0n),+0s,2299161j)>:upto(#<Date: 2014-11-06 ((2456968j,0s,0n),+0s,2299161j)>)>

* Collection and container objects

  Ruby implements collections principally through classes that min
  in ~Enumerable~.

  ~with_index~ is a method which yields a counter value along with
  the enumerator. Pretty new and preferable to ~each_with_index~.

