notes/ruby.html

<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> Querying strings</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li><code>String#include?('cool')</code>
</li>
<li><code>String#start_with?('ruby')</code>
</li>
<li><code>String#empty?</code>
</li>
<li><code>String#size</code>
</li>
<li><code>String#count('a')</code>, range of letters <code>String#count('a-c')</code> and you can
combine arguments <code>String#count('a-c', '^b' )</code> (any letters from a
to c that is not b)
</li>
<li><code>String#index('cool')</code>
</li>
<li><code>String#ord</code> gives ordinal code of first character. Reverse
operation is <code>String#chr</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> String comparison</h3>
<div class="outline-text-3" id="text-8-5">
<ul class="org-ul">
<li><code>==</code> for equality of content
</li>
<li><code>String#equal?</code> for equality of object
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> transformations</h3>
<div class="outline-text-3" id="text-8-6">
<ul class="org-ul">
<li><code>String#upcase</code>
</li>
<li><code>String#downcase</code>
</li>
<li><code>String#upcase</code>
</li>
<li><code>String#swapcase</code>
</li>
<li><code>String#capitalize</code>
</li>
<li><code>String#rjust(5)</code> and <code>String#ljust(5)</code> add padding to the
right of left with either blank spaces or a char if you add a
second char parameter.
</li>
<li><code>String#center(5)</code>. Same as <i>rjust</i> and <i>ljust</i> for parameters
</li>
<li><code>String#strip</code>, <code>String#lstrip</code> &amp; <code>String#rstrip</code> removes
whitespaces
</li>
<li><code>String#chop</code> to remove a character at the end of the string
</li>
<li><code>String#chomp</code> to remove a newline character. You can target
other characters or strings by providing an argument <code>String#chomp('ab')</code>
</li>
<li><code>String#clear</code> clears the receiver. No ! but it changes the receiver.
</li>
<li><code>String#replace</code>
</li>
<li><code>String#delete</code> same rules for arguments as with count.
</li>
<li><code>String#succ</code> increment letters in a string. Handy when you
need a batch of generated unique strings.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="section-number-3">8.7</span> Conversions</h3>
<div class="outline-text-3" id="text-8-7">
<p>
<code>to_sum</code>, <code>to_f</code>, <code>to_i</code>
You can provide a parameter to <code>to_i</code> to specify a base.
<code>.oct</code> for octal and <code>.hex</code> for hexadecimal.
</p>
</div>
</div>

<div id="outline-container-sec-8-8" class="outline-3">
<h3 id="sec-8-8"><span class="section-number-3">8.8</span> Encoding</h3>
<div class="outline-text-3" id="text-8-8">
<p>
In Ruby 2 the default encoding for ruby scripts is UTF-8.
</p>

<p>
you can use <code>__ENCODING__</code> to know the encoding value. Directly
in the file. If you run this command on the command line
through <code>$ ruby -e 'puts __ENCODING__</code> you will get the current
locale setting which can differ.
</p>

<p>
You can use a magic comment at the top of the file <code># encoding:
   encoding_Value</code> to change the encoding of a file.
</p>
</div>

<div id="outline-container-sec-8-8-1" class="outline-4">
<h4 id="sec-8-8-1"><span class="section-number-4">8.8.1</span> Strings</h4>
<div class="outline-text-4" id="text-8-8-1">
<p>
<code>String#encoding</code> to get the encoding.
</p>

<p>
You can encode a string in a different encoding as long as the
conversion is permitted. This is called transcoding.
<code>String.encode('US-ASCII')</code>. The bang version changes the
encoding of the string permanently.
</p>

<p>
You can force an encoding <code>String#force_encoding('US-ASCII')</code>
</p>

<p>
You can represent characters with escape sequence. <code>\x</code> for
two digit hexadecimal numbers representing a byte. <code>\u</code>
followed by a UTF-8 code to insert the corresponding
character. By doing this you can change a string encoding to
UTF-8 (if it was in ASCII and the character inserted does not
exist in ASCII).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-8-9" class="outline-3">
<h3 id="sec-8-9"><span class="section-number-3">8.9</span> Symbols</h3>
<div class="outline-text-3" id="text-8-9">
<p>
literal constructor <code>:symbol_name</code>
</p>

<ul class="org-ul">
<li>symbols are immutable
</li>
<li>symbols are unique. Thus there is no point in having
constructor for them. They are like integers in that respect
</li>
</ul>

<p>
When you bin a variable to a symbol you bind its value, not a
reference to it.
</p>

<p>
You can list all symbols with <code>Symbol.all_symbols</code>
</p>

<p>
If you want to check if a symbol exist you can use <i>grep</i>
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #228b22;">Symbol</span>.all_symbols.grep(<span style="color: #8b2252;">/abc/</span>)
</pre>
</div>

<p>
Don't use <code>include?(:abc)</code> because this very act creates the
symbol!
</p>

<p>
Symbols appears most of the times in method arguments and hash
keys. They are better for hash keys because ruby can process
them faster and they —look good— as hash keys. Ruby also use a
convenient way to use symbol as hash keys
</p>

<p>
The following two are equivalent
</p>
<div class="org-src-container">

<pre class="src src-ruby">hash = { <span style="color: #008b8b;">:name</span> =&gt; <span style="color: #8b2252;">'David'</span>, <span style="color: #008b8b;">:age</span> =&gt; 35 }
hash = { <span style="color: #008b8b;">name</span>: <span style="color: #8b2252;">'David'</span>, <span style="color: #008b8b;">age</span>: 35}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-8-10" class="outline-3">
<h3 id="sec-8-10"><span class="section-number-3">8.10</span> Numerical object</h3>
<div class="outline-text-3" id="text-8-10">
<p>
At the top <i>Numeric</i>.
<i>Float</i> and <i>Integer</i> below.
<i>Fixnum</i> and <i>Bignum</i> below Integer. Ruby handles the
conversion automatically when you need <i>Bignum</i>.
</p>

<p>
With divisions, when you want integers you have to specify it.
</p>

<div class="org-src-container">

<pre class="src src-ruby">3 / 2
</pre>
</div>


<div class="org-src-container">

<pre class="src src-ruby">3 / 2.0
</pre>
</div>

<p>
Hexadecimals with leading 0x
</p>

<div class="org-src-container">

<pre class="src src-ruby">0x12 + 10
</pre>
</div>

<p>
Octals when leading 0
</p>

<div class="org-src-container">

<pre class="src src-ruby">012 + 10
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-8-11" class="outline-3">
<h3 id="sec-8-11"><span class="section-number-3">8.11</span> Times and dates</h3>
<div class="outline-text-3" id="text-8-11">
<p>
3 classes. <i>Time</i>, <i>Date</i> and <i>DateTime</i>
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #483d8b;">require</span> <span style="color: #8b2252;">'time'</span>
<span style="color: #483d8b;">require</span> <span style="color: #8b2252;">'date'</span> <span style="color: #b22222;">#</span><span style="color: #b22222;">provides both Date and Datetime</span>
</pre>
</div>

<p>
You can query for <code>leap?</code> years and <code>dst?</code> (daylight saving
time)
There is an <code>strftime</code> methods to format
Precooked format <i>rfc2822</i> for email and <code>httpdate</code> (RFC 2616
standard).
You can use <code>upto</code> and <code>downto</code> to iterate over a range of them
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #483d8b;">require</span> <span style="color: #8b2252;">'date'</span>
d = <span style="color: #228b22;">Date</span>.today
next_week = d + 7

d.upto(next_week)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Collection and container objects</h2>
<div class="outline-text-2" id="text-9">
<p>
Ruby implements collections principally through classes that min
in <code>Enumerable</code>.
</p>

<p>
<code>with_index</code> is a method which yields a counter value along with
the enumerator. Pretty new and preferable to <code>each_with_index</code>.
</p>
</div>
