notes/ruby.org
** Array
   You can create an array with
   + ~Array.new~
#+BEGIN_SRC ruby
  Array.new(3) # [nil, nil, nil]
#+END_SRC

   Be careful with the following example. The 3 elements of the
   array are initialized with the same string. If you modify it
   for one element, you modify it for all elements of the Array.
#+BEGIN_SRC ruby
  Array.new(3, 'abc')
#+END_SRC

#+RESULTS:
| abc | abc | abc |

   With a block, all 3 strings are different
#+BEGIN_SRC ruby
Array.new(3) { 'abc'}
#+END_SRC

#+RESULTS:
| abc | abc | abc |

#+BEGIN_SRC ruby
  n = 0
  Array.new(3) { n += 1; n * 10}
#+END_SRC

#+RESULTS:
| 10 | 20 | 30 |


   + []
   + top level method ~Array~
     If an element has an ~to~ary~ method the ~Array~ call use
     that method. If not it tries with ~to_a~. If not it wraps the
     object in an Array

#+BEGIN_SRC ruby
  string = "cool"
  def string.to_a
    split(//)
  end
  Array(string)
#+END_SRC

#+RESULTS:
| c | o | o | l |

   + special notations %w{} and #i{}

     %w single quoted and %W double quoted
#+BEGIN_SRC ruby
%w{ It is a small world }
#+END_SRC

#+RESULTS:
| It | is | a | small | world |

     %i and %I for array of symbols single and double quoted

#+BEGIN_SRC ruby
%i{It is a small world}
#+END_SRC

#+RESULTS:
| :It | :is | :a | :small | :world |

*** Inserting, retrieving and removing from an array

| Sample call                    | Meaning                                             |
|--------------------------------+-----------------------------------------------------|
| ~a[3, 2]~                      | select two elements starting at index 3             |
| ~array.values_At(0,3)~         | select values at index 0 and 3                      |
| ~a.unshift(0)~                 | adds 0 at start of array                            |
| ~a.shift(n=1)~                 | remove n elements from beginning of array           |
| ~a.pop(n=1)~                   | remove n elements from end of array                 |
| ~a.push(6,7,8)~                | adds 6, 7 and 8 at the end of the array             |
| ~a << 5~                       | add 5 at the end of the array                       |
| ~[1, 2, 3].concat([4, 5, 6])~  | ~[1, 2, 3, 4, 5, 6]~ – changes permanently receiver |
| ~[1, 2, 3] + [4, 5, 6]~        | ~[1, 2, 3, 4, 5, 6]~ – creates a new array          |
| ~[1, 2, 4].replace([4, 5, 6])~ | ~[4, 5, 6]~ – Keeps same object                     |
| ~[1, [2, [3, 4]]].flatten~     | ~[1, 2, 3]~ – flattens completely                   |
| ~[1, [2, [3, 4]]].flatten(1)~  | ~[1, 2, [3, 4]]~ – flattens one level               |
| ~[1, 2, 3, 4].reverse~         | ~[4, 3, 2, 1]~                                      |
| ~['abc', 'def'].join(arg='')~  | ~abcdef~ – join all argument and returns a string   |
| ~[1, 1, 2, 3].uniq~            | ~[1, 2, 3]~                                         |
| ~[1, nil, 2, nil].compact~     | ~[1, 2]~ – removes nil                              |

*** Querying

| Sample call             | Meaning                          |
|-------------------------+----------------------------------|
| ~a.size~ and ~a.length~ | Number of elements in array      |
| ~a.empty?~              | True if a is empty               |
| ~a.include?(element)~   | True if array includes ~element~ |
| ~a.count(element)~      | number of ~element~              |
| ~a.first(n=1)~          | first n elements                 |
| ~a.last(n=1)~           | last n elements                  |
| ~a.smaple(n=1)~         | n random elements                |

** Hashes
   Hashes are now ordered collections.

   You can use ~(key, value)~ in blocks to get the hash element
   array distributed accross two parameters.
   Key values are unique
   Hash provides quick lookup in better than linear time

#+BEGIN_SRC ruby
  hash = { red: 'ruby', white: 'diamond', green: 'emerald'}
  output = ''
  hash.each.with_index do |(key, value), i|
    output << "PAIR #{i} is #{key}/#{value}\n"
  end
  output
#+END_SRC

#+RESULTS:
: PAIR 0 is red/ruby
: PAIR 1 is white/diamond
: PAIR 2 is green/emerald

   You can create an Hash with:
   + ~{}~
     #+BEGIN_SRC ruby
       h = {}
     #+END_SRC
   + ~Hash.new~
     #+BEGIN_SRC ruby
       h = Hash.new(3) #argument serves as default value for nonexistent hash keys
       h[:my_key]
     #+END_SRC

     #+RESULTS:
     : 3

     You can use blocks too!
     #+BEGIN_SRC ruby
       h = Hash.new {|hash, key| hash[key] = 0 }
       h[:my_key]
     #+END_SRC

     #+RESULTS:
     : 0

   + ~Hash.[]~
     If you provide an odd number of argument a fatal error is raised
     #+BEGIN_SRC ruby
       Hash['France', 'fr', 'USA', 'us']
     #+END_SRC

     #+RESULTS:
     | France | => | fr | USA | => | us |
   + ~Hash~
     Calls ~to_hash~ on its single argument. Except if you pass it
     an empty ~Array~ or ~nil~ — it returns an empty hash ~{}~

     #+BEGIN_SRC ruby
       Hash([])
     #+END_SRC

     #+RESULTS:
     : {}

