notes/ruby.html

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Array</h3>
<div class="outline-text-3" id="text-9-1">
<p>
You can create an array with
</p>
<ul class="org-ul">
<li><code>Array.new</code>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #228b22;">Array</span>.new(3) <span style="color: #b22222;"># </span><span style="color: #b22222;">[nil, nil, nil]</span>
</pre>
</div>

<p>
Be careful with the following example. The 3 elements of the
array are initialized with the same string. If you modify it
for one element, you modify it for all elements of the Array.
</p>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #228b22;">Array</span>.new(3, <span style="color: #8b2252;">'abc'</span>)
</pre>
</div>

<p>
With a block, all 3 strings are different
</p>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #228b22;">Array</span>.new(3) { <span style="color: #8b2252;">'abc'</span>}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-ruby">n = 0
<span style="color: #228b22;">Array</span>.new(3) { n += 1; n * 10}
</pre>
</div>


<ul class="org-ul">
<li>[]
</li>
<li>top level method <code>Array</code>
If an element has an <code>to~ary</code> method the <code>Array</code> call use
that method. If not it tries with <code>to_a</code>. If not it wraps the
object in an Array
</li>
</ul>

<div class="org-src-container">

<pre class="src src-ruby">string = <span style="color: #8b2252;">"cool"</span>
<span style="color: #a020f0;">def</span> string.<span style="color: #0000ff;">to_a</span>
  split(<span style="color: #8b2252;">//</span>)
<span style="color: #a020f0;">end</span>
<span style="color: #483d8b;">Array</span>(string)
</pre>
</div>

<ul class="org-ul">
<li>special notations %w{} and #i{}

<p>
%w single quoted and %W double quoted
</p>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #8b2252;">%w{ It is a small world }</span>
</pre>
</div>

<p>
%i and %I for array of symbols single and double quoted
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #8b2252;">%i{It is a small world}</span>
</pre>
</div>
</div>

<div id="outline-container-sec-9-1-1" class="outline-4">
<h4 id="sec-9-1-1"><span class="section-number-4">9.1.1</span> Inserting, retrieving and removing from an array</h4>
<div class="outline-text-4" id="text-9-1-1">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Sample call</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>a[3, 2]</code></td>
<td class="left">select two elements starting at index 3</td>
</tr>

<tr>
<td class="left"><code>array.values_At(0,3)</code></td>
<td class="left">select values at index 0 and 3</td>
</tr>

<tr>
<td class="left"><code>a.unshift(0)</code></td>
<td class="left">adds 0 at start of array</td>
</tr>

<tr>
<td class="left"><code>a.shift(n=1)</code></td>
<td class="left">remove n elements from beginning of array</td>
</tr>

<tr>
<td class="left"><code>a.pop(n=1)</code></td>
<td class="left">remove n elements from end of array</td>
</tr>

<tr>
<td class="left"><code>a.push(6,7,8)</code></td>
<td class="left">adds 6, 7 and 8 at the end of the array</td>
</tr>

<tr>
<td class="left"><code>a &lt;&lt; 5</code></td>
<td class="left">add 5 at the end of the array</td>
</tr>

<tr>
<td class="left"><code>[1, 2, 3].concat([4, 5, 6])</code></td>
<td class="left"><code>[1, 2, 3, 4, 5, 6]</code> – changes permanently receiver</td>
</tr>

<tr>
<td class="left"><code>[1, 2, 3] + [4, 5, 6]</code></td>
<td class="left"><code>[1, 2, 3, 4, 5, 6]</code> – creates a new array</td>
</tr>

<tr>
<td class="left"><code>[1, 2, 4].replace([4, 5, 6])</code></td>
<td class="left"><code>[4, 5, 6]</code> – Keeps same object</td>
</tr>

<tr>
<td class="left"><code>[1, [2, [3, 4]]].flatten</code></td>
<td class="left"><code>[1, 2, 3]</code> – flattens completely</td>
</tr>

<tr>
<td class="left"><code>[1, [2, [3, 4]]].flatten(1)</code></td>
<td class="left"><code>[1, 2, [3, 4]]</code> – flattens one level</td>
</tr>

<tr>
<td class="left"><code>[1, 2, 3, 4].reverse</code></td>
<td class="left"><code>[4, 3, 2, 1]</code></td>
</tr>

<tr>
<td class="left"><code>['abc', 'def'].join(arg='')</code></td>
<td class="left"><code>abcdef</code> – join all argument and returns a string</td>
</tr>

<tr>
<td class="left"><code>[1, 1, 2, 3].uniq</code></td>
<td class="left"><code>[1, 2, 3]</code></td>
</tr>

<tr>
<td class="left"><code>[1, nil, 2, nil].compact</code></td>
<td class="left"><code>[1, 2]</code> – removes nil</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-9-1-2" class="outline-4">
<h4 id="sec-9-1-2"><span class="section-number-4">9.1.2</span> Querying</h4>
<div class="outline-text-4" id="text-9-1-2">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Sample call</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>a.size</code> and <code>a.length</code></td>
<td class="left">Number of elements in array</td>
</tr>

<tr>
<td class="left"><code>a.empty?</code></td>
<td class="left">True if a is empty</td>
</tr>

<tr>
<td class="left"><code>a.include?(element)</code></td>
<td class="left">True if array includes <code>element</code></td>
</tr>

<tr>
<td class="left"><code>a.count(element)</code></td>
<td class="left">number of <code>element</code></td>
</tr>

<tr>
<td class="left"><code>a.first(n=1)</code></td>
<td class="left">first n elements</td>
</tr>

<tr>
<td class="left"><code>a.last(n=1)</code></td>
<td class="left">last n elements</td>
</tr>

<tr>
<td class="left"><code>a.smaple(n=1)</code></td>
<td class="left">n random elements</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Hashes</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Hashes are now ordered collections.
</p>

<p>
You can use <code>(key, value)</code> in blocks to get the hash element
array distributed accross two parameters.
Key values are unique
Hash provides quick lookup in better than linear time
</p>

<div class="org-src-container">

<pre class="src src-ruby">hash = { <span style="color: #008b8b;">red</span>: <span style="color: #8b2252;">'ruby'</span>, <span style="color: #008b8b;">white</span>: <span style="color: #8b2252;">'diamond'</span>, <span style="color: #008b8b;">green</span>: <span style="color: #8b2252;">'emerald'</span>}
output = <span style="color: #8b2252;">''</span>
hash.each.with_index <span style="color: #a020f0;">do</span> |(key, value), i|
  output &lt;&lt; <span style="color: #8b2252;">"PAIR </span><span style="color: #a0522d;">#{i}</span><span style="color: #8b2252;"> is </span><span style="color: #a0522d;">#{key}</span><span style="color: #8b2252;">/</span><span style="color: #a0522d;">#{value}</span><span style="color: #8b2252;">\n"</span>
<span style="color: #a020f0;">end</span>
output
</pre>
</div>

<p>
You can create an Hash with:
</p>
<ul class="org-ul">
<li><code>{}</code>
<div class="org-src-container">

<pre class="src src-ruby">h = {}
</pre>
</div>
</li>
<li><code>Hash.new</code>
<div class="org-src-container">

<pre class="src src-ruby">h = <span style="color: #228b22;">Hash</span>.new(3) <span style="color: #b22222;">#</span><span style="color: #b22222;">argument serves as default value for nonexistent hash keys</span>
h[<span style="color: #008b8b;">:my_key</span>]
</pre>
</div>

<p>
You can use blocks too!
</p>
<div class="org-src-container">

<pre class="src src-ruby">h = <span style="color: #228b22;">Hash</span>.new {|hash, key| hash[key] = 0 }
h[<span style="color: #008b8b;">:my_key</span>]
</pre>
</div>
</li>

<li><code>Hash.[]</code>
     If you provide an odd number of argument a fatal error is raised
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #228b22;">Hash</span>[<span style="color: #8b2252;">'France'</span>, <span style="color: #8b2252;">'fr'</span>, <span style="color: #8b2252;">'USA'</span>, <span style="color: #8b2252;">'us'</span>]
</pre>
</div>
</li>
<li><code>Hash</code>
Calls <code>to_hash</code> on its single argument. Except if you pass it
an empty <code>Array</code> or <code>nil</code> — it returns an empty hash <code>{}</code>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #483d8b;">Hash</span>([])
</pre>
</div>
</li>
</ul>
</div>
