notes/ruby.org
*** Hash methods

   | Sample call                        | Meaning                                               |
   |------------------------------------+-------------------------------------------------------|
   | ~=h['France'] = 'fr'=~             | adds a key/value pair                                 |
   | ~h.store('France', 'fr')~          | adds a key/value pair                                 |
   | ~h['France']~                      | fetch value                                           |
   | ~h.fetch('France')~                | fetch value, raises an exception for non existent key |
   | ~h.values_att('France', 'USA')~    | return arrays of value                                |
   | ~h1.update(h2)~ or ~h1.merge!(h2)~ | h1 keys are overwritted with corresponding h2 keys    |
   | ~h1.merge(h2)~                     | creates a new hash combining h1 and h2.               |
   |                                    | If both hash have keys in common h2 keys win          |
   | ~h.select {\vert{}k,v\vert k > 1}~           | creates a subhash by selection                        |
   | ~h.reject {\vert{}k,v\vert k > 1}~           | creates a subhash by rejection                        |
   | ~select!~ and ~reject!~            | returns nil if hash does not change                   |
   | ~keep_if~ and ~delete_if~          | returns original hash even if it’s unchanged          |
   | ~h.invert~                         | invert keys and values. Careful:keys must be unique   |
   | ~h.clear~                          | clears a hash                                         |
   | ~h.replace~                        | replace content of a hash                             |


*** Querying

    | Method name       | Meaning |
    | ~h.has_key(1)~    |         |
    | ~h.include?(1)~   |         |
    | ~h.member?(1)~    |         |
    | ~h.has_value?(1)~ |         |
    | ~h.value?(1)~     |         |
    | ~h.empty?~        |         |
    | ~h.size~          |         |

** Ranges
   Semantics of range:
   + /Inclusion/
   + /Enumeration/

     You can remember inclusive /../ and exclusive /.../ range
     notation by thinking of a range as always reaching to the
     point represented by whatever follows the second dot.


   You can create ranges with
   + ~Range.new~
     #+BEGIN_SRC ruby
       Range.new(1, 100)
     #+END_SRC

     #+RESULTS:
     : 1..100

     #+BEGIN_SRC ruby
       Range.new(1, 100, true)
     #+END_SRC

     #+RESULTS:
     : 1...100

   + Literal syntax
     #+BEGIN_SRC ruby
       1..100
     #+END_SRC

     #+RESULTS:
     : 1..100


   Ranges have ~begin~ and ~end~ method which report their
   beginning and end point.
   They also have ~exclude_end?~ which tells you if it is an
   exclusive or inclusive range.
   They have a ~cover?~ method to know if parameter falls in
   range.
   #+BEGIN_SRC ruby
     ('a'..'z').cover?('abc')
   #+END_SRC

   #+RESULTS:
   : true

   They have an ~include?~ method which treats range as arrays.
   Therefore results differs from ~cover?~
   #+BEGIN_SRC ruby
     ('a'..'z').include?('abc')
   #+END_SRC

   #+RESULTS:
   : false

   Don't create backward range. They won't do what you think they
   do.

   #+BEGIN_SRC ruby
     (100..1).include?(50)
   #+END_SRC

   #+RESULTS:
   : false

** Sets
   A set is a unique collection of objects.

   You need to
   #+BEGIN_SRC ruby
     require 'set'
   #+END_SRC


   You can create sets with ~Set.new~ by providing a collection of
   objects and optionally a code block.

   #+BEGIN_SRC ruby
     require 'set'
     Set.new(['Aurélien','Romain', 'Andréa']) {|name| name.upcase}
   #+END_SRC

   Use ~<<~ to add a single object to a set.
   You can also use ~add~ to add an object to a set. ~add?~
   returns nil if the set is unchanged after add operation.
   Use ~delete~ to remove an object for a set.


   You can use ~&~ to perform intersections. ~+~ and ~|~ for
   unions and ~-~ for differences.
   There is also an ~^~ exclusive or operator.

   Merging a hash into a set results in the addition of
   two-element.
   You can test for ~subset?~ and ~superset?~.

* Collections Central: Enumerable and Enumerator

  You can mixin in ~Enumerable~ and define an ~each~ instance
  method. You will be able to call any instance method defined in
  ~Enumerable~.
  ~each~ job is to /yield/ items.

  #+BEGIN_SRC ruby
    class BlueColors
      include Enumerable

      def each
        yield 'Light Blue'
        yield 'Blue'
        yield 'Dark Blue'
      end
    end

    BlueColors.new.each { |c| puts c }
    BlueColors.find { |c| c.start_with?('B') }
  #+END_SRC


**  Queries:
   + ~include?~
   + ~all?~
   + ~any?~
   + ~one?~
   + ~none?~


   Be careful when enumerating with ranges.

   #+BEGIN_SRC ruby
     (1.0..10.0).one? { |n| n == 5}
   #+END_SRC

   #+RESULTS:
   : can't iterate from Float (TypeError)


** Search and Select

   + ~find~. You can provide a failure-handling function
     #+BEGIN_SRC ruby
       failure = lambda { 11 }
       [1,2,3,4,5,6].find(failure) {|n| n> 10}
     #+END_SRC

     #+RESULTS:
     : 11

   + ~find_all~ also known as ~select~. Always returns an array.
     There’s a ~select!~.
   + ~reject~. Always returns an array
   + ~grep~. Based on ~===~
   + ~group_by~. Returns a Hash
     #+BEGIN_SRC ruby
       colors = %w{ red orange yellow green blue indigo violet}
       colors.group_by {|color| color.size}
     #+END_SRC

     #+RESULTS:
     | 3=> | (red) | 6=> | (orange yellow indigo violet) | 5=> | (green) | 4=> | (blue) |
   + ~partition~. Similar to ~group_by~ but split into two arrays.


