notes/ruby.html

<div id="outline-container-sec-9-2-1" class="outline-4">
<h4 id="sec-9-2-1"><span class="section-number-4">9.2.1</span> Hash methods</h4>
<div class="outline-text-4" id="text-9-2-1">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Sample call</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>=h['France'] = 'fr'=</code></td>
<td class="left">adds a key/value pair</td>
</tr>

<tr>
<td class="left"><code>h.store('France', 'fr')</code></td>
<td class="left">adds a key/value pair</td>
</tr>

<tr>
<td class="left"><code>h['France']</code></td>
<td class="left">fetch value</td>
</tr>

<tr>
<td class="left"><code>h.fetch('France')</code></td>
<td class="left">fetch value, raises an exception for non existent key</td>
</tr>

<tr>
<td class="left"><code>h.values_att('France', 'USA')</code></td>
<td class="left">return arrays of value</td>
</tr>

<tr>
<td class="left"><code>h1.update(h2)</code> or <code>h1.merge!(h2)</code></td>
<td class="left">h1 keys are overwritted with corresponding h2 keys</td>
</tr>

<tr>
<td class="left"><code>h1.merge(h2)</code></td>
<td class="left">creates a new hash combining h1 and h2.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">If both hash have keys in common h2 keys win</td>
</tr>

<tr>
<td class="left"><code>h.select {\vert{}k,v\vert k &gt; 1}</code></td>
<td class="left">creates a subhash by selection</td>
</tr>

<tr>
<td class="left"><code>h.reject {\vert{}k,v\vert k &gt; 1}</code></td>
<td class="left">creates a subhash by rejection</td>
</tr>

<tr>
<td class="left"><code>select!</code> and <code>reject!</code></td>
<td class="left">returns nil if hash does not change</td>
</tr>

<tr>
<td class="left"><code>keep_if</code> and <code>delete_if</code></td>
<td class="left">returns original hash even if it’s unchanged</td>
</tr>

<tr>
<td class="left"><code>h.invert</code></td>
<td class="left">invert keys and values. Careful:keys must be unique</td>
</tr>

<tr>
<td class="left"><code>h.clear</code></td>
<td class="left">clears a hash</td>
</tr>

<tr>
<td class="left"><code>h.replace</code></td>
<td class="left">replace content of a hash</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-9-2-2" class="outline-4">
<h4 id="sec-9-2-2"><span class="section-number-4">9.2.2</span> Querying</h4>
<div class="outline-text-4" id="text-9-2-2">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Method name</td>
<td class="left">Meaning</td>
</tr>

<tr>
<td class="left"><code>h.has_key(1)</code></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>h.include?(1)</code></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>h.member?(1)</code></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>h.has_value?(1)</code></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>h.value?(1)</code></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>h.empty?</code></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>h.size</code></td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> Ranges</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Semantics of range:
</p>
<ul class="org-ul">
<li><i>Inclusion</i>
</li>
<li><i>Enumeration</i>

<p>
You can remember inclusive <i>..</i> and exclusive <i>&#x2026;</i> range
notation by thinking of a range as always reaching to the
point represented by whatever follows the second dot.
</p>
</li>
</ul>


<p>
You can create ranges with
</p>
<ul class="org-ul">
<li><code>Range.new</code>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #228b22;">Range</span>.new(1, 100)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #228b22;">Range</span>.new(1, 100, <span style="color: #a0522d;">true</span>)
</pre>
</div>
</li>

<li>Literal syntax
<div class="org-src-container">

<pre class="src src-ruby">1..100
</pre>
</div>
</li>
</ul>


<p>
Ranges have <code>begin</code> and <code>end</code> method which report their
beginning and end point.
They also have <code>exclude_end?</code> which tells you if it is an
exclusive or inclusive range.
They have a <code>cover?</code> method to know if parameter falls in
range.
</p>
<div class="org-src-container">

<pre class="src src-ruby">(<span style="color: #8b2252;">'a'</span>..<span style="color: #8b2252;">'z'</span>).cover?(<span style="color: #8b2252;">'abc'</span>)
</pre>
</div>

<p>
They have an <code>include?</code> method which treats range as arrays.
Therefore results differs from <code>cover?</code>
</p>
<div class="org-src-container">

<pre class="src src-ruby">(<span style="color: #8b2252;">'a'</span>..<span style="color: #8b2252;">'z'</span>).include?(<span style="color: #8b2252;">'abc'</span>)
</pre>
</div>

<p>
Don't create backward range. They won't do what you think they
do.
</p>

<div class="org-src-container">

<pre class="src src-ruby">(100..1).include?(50)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> Sets</h3>
<div class="outline-text-3" id="text-9-4">
<p>
A set is a unique collection of objects.
</p>

<p>
You need to
</p>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #483d8b;">require</span> <span style="color: #8b2252;">'set'</span>
</pre>
</div>


<p>
You can create sets with <code>Set.new</code> by providing a collection of
objects and optionally a code block.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #483d8b;">require</span> <span style="color: #8b2252;">'set'</span>
<span style="color: #228b22;">Set</span>.new([<span style="color: #8b2252;">'Aur&#233;lien'</span>,<span style="color: #8b2252;">'Romain'</span>, <span style="color: #8b2252;">'Andr&#233;a'</span>]) {|name| name.upcase}
</pre>
</div>

<p>
Use <code>&lt;&lt;</code> to add a single object to a set.
You can also use <code>add</code> to add an object to a set. <code>add?</code>
returns nil if the set is unchanged after add operation.
Use <code>delete</code> to remove an object for a set.
</p>


<p>
You can use <code>&amp;</code> to perform intersections. <code>+</code> and <code>|</code> for
unions and <code>-</code> for differences.
There is also an <code>^</code> exclusive or operator.
</p>

<p>
Merging a hash into a set results in the addition of
two-element.
You can test for <code>subset?</code> and <code>superset?</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Collections Central: Enumerable and Enumerator</h2>
<div class="outline-text-2" id="text-10">
<p>
You can mixin in <code>Enumerable</code> and define an <code>each</code> instance
method. You will be able to call any instance method defined in
<code>Enumerable</code>.
<code>each</code> job is to <i>yield</i> items.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">BlueColors</span>
  <span style="color: #483d8b;">include</span> <span style="color: #228b22;">Enumerable</span>

  <span style="color: #a020f0;">def</span> <span style="color: #0000ff;">each</span>
    <span style="color: #a020f0;">yield</span> <span style="color: #8b2252;">'Light Blue'</span>
    <span style="color: #a020f0;">yield</span> <span style="color: #8b2252;">'Blue'</span>
    <span style="color: #a020f0;">yield</span> <span style="color: #8b2252;">'Dark Blue'</span>
  <span style="color: #a020f0;">end</span>
<span style="color: #a020f0;">end</span>

<span style="color: #228b22;">BlueColors</span>.new.each { |c| <span style="color: #483d8b;">puts</span> c }
<span style="color: #228b22;">BlueColors</span>.find { |c| c.start_with?(<span style="color: #8b2252;">'B'</span>) }
</pre>
</div>
</div>


<div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Queries:</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li><code>include?</code>
</li>
<li><code>all?</code>
</li>
<li><code>any?</code>
</li>
<li><code>one?</code>
</li>
<li><code>none?</code>
</li>
</ul>


<p>
Be careful when enumerating with ranges.
</p>

<div class="org-src-container">

<pre class="src src-ruby">(1.0..10.0).one? { |n| n == 5}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Search and Select</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li><code>find</code>. You can provide a failure-handling function
<div class="org-src-container">

<pre class="src src-ruby">failure = <span style="color: #483d8b;">lambda</span> { 11 }
[1,2,3,4,5,6].find(failure) {|n| n&gt; 10}
</pre>
</div>
</li>

<li><code>find_all</code> also known as <code>select</code>. Always returns an array.
There’s a <code>select!</code>.
</li>
<li><code>reject</code>. Always returns an array
</li>
<li><code>grep</code>. Based on <code>===</code>
</li>
<li><code>group_by</code>. Returns a Hash
<div class="org-src-container">

<pre class="src src-ruby">colors = <span style="color: #8b2252;">%w{ red orange yellow green blue indigo violet}</span>
colors.group_by {|color| color.size}
</pre>
</div>
</li>
<li><code>partition</code>. Similar to <code>group_by</code> but split into two arrays.
</li>
</ul>
</div>
</div>
