notes/ruby.org
** Element operations:
   + ~first~. There is no default ~last~ because there are some
     iterations that goes forever. ~Array~ and ~Range~ have a
     ~last~ method.
   + ~take~ and ~take_while~
   + ~drop~ and ~drop_while~
   + ~min~ and ~max~. Determined by ~<=>~ (spaceship operator).
   + ~min_by~ and ~max_by~
   + ~minmax_by~ and ~maxmin_by~


** Each relatives
   + ~reverse_each~
   + ~with_index~. ~each_with_index~ is somewhat deprecated.
     With ~with_index~ you can provide an argument that will be
     used as the first index value.
   + ~each_slice(n)~ handles each element once. ~each_cons(3)~
     takes a new grouping at each element.
   + ~cycle(n)~ to decide how many times you want to cycle through
     a collection.
   + ~inject~ similar to reduce and fold in functional languages.
     #+BEGIN_SRC ruby
       [1,2,3,4].inject(0) {|acc, n| acc + n}
     #+END_SRC

     #+RESULTS:
     : 10
   + ~map~ also available as ~collect~
     ~each~ returns its receiver
     ~map~ returns a new object
