notes/ruby.html


<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> Element operations:</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li><code>first</code>. There is no default <code>last</code> because there are some
iterations that goes forever. <code>Array</code> and <code>Range</code> have a
<code>last</code> method.
</li>
<li><code>take</code> and <code>take_while</code>
</li>
<li><code>drop</code> and <code>drop_while</code>
</li>
<li><code>min</code> and <code>max</code>. Determined by <code>&lt;=&gt;</code> (spaceship operator).
</li>
<li><code>min_by</code> and <code>max_by</code>
</li>
<li><code>minmax_by</code> and <code>maxmin_by</code>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> Each relatives</h3>
<div class="outline-text-3" id="text-10-4">
<ul class="org-ul">
<li><code>reverse_each</code>
</li>
<li><code>with_index</code>. <code>each_with_index</code> is somewhat deprecated.
With <code>with_index</code> you can provide an argument that will be
used as the first index value.
</li>
<li><code>each_slice(n)</code> handles each element once. <code>each_cons(3)</code>
     takes a new grouping at each element.
</li>
<li><code>cycle(n)</code> to decide how many times you want to cycle through
a collection.
</li>
<li><code>inject</code> similar to reduce and fold in functional languages.
<div class="org-src-container">

<pre class="src src-ruby">[1,2,3,4].inject(0) {|acc, n| acc + n}
</pre>
</div>
</li>
<li><code>map</code> also available as <code>collect</code>
<code>each</code> returns its receiver
<code>map</code> returns a new object
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aurélien Bottazini</p>
<p class="date">Created: 2014-11-10 Mon 17:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
